УТ_для_edt/src/AccumulationRegisters/смартЗаявкиНаРазборкуОборудования/смартЗаявкиНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартЗаявкиНаРазборкуОборудования</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/смартОборудованиеКРазборке/смартОборудованиеКРазборке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартОборудованиеКРазборке</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРазборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщикуЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудованиеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/смартЗаявкаНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЗаявкаНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.смартЗаявкиНаРазборкуОборудования</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереместитьСоСклада</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаРазбора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.смартСтатусыСогласованияЗаявокНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КВыполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРазборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелПереместитьНаСклад</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСнятаяЗапаснаяЧасть</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПолученныйУзел</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНаЗаменуСнятойЗапаснойЧасти</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаНеТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <comment>#1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования</comment>
    <attributes>
      <name>АртикулСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереместитьНаСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаказывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера2</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/CommonModules/смартСборкаРазборкаОборудованияСервер/Module.bsl
#Область ПрограммныйИнтерфейс

//++ #1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования
Процедура ОтразитьЗаявкиНаРазборкуОборудования(ДополнительныеСвойства, Движения, Отказ) Экспорт
	                                                                  
	ТаблицаЗаявкиНаРазборкуОборудования = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмартЗаявкиНаРазборкуОборудования;
	
	Если Отказ ИЛИ ТаблицаЗаявкиНаРазборкуОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаявкиНаРазборкуОборудования = Движения.смартЗаявкиНаРазборкуОборудования;
	ДвиженияЗаявкиНаРазборкуОборудования.Записывать = Истина;
	ДвиженияЗаявкиНаРазборкуОборудования.Загрузить(ТаблицаЗаявкиНаРазборкуОборудования);	
	
КонецПроцедуры 

//++ #1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования
Процедура ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ) Экспорт
	                                                                  
	ТаблицаОборудованиеКРазборке = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмартОборудованиеКРазборке;
	
	Если Отказ ИЛИ ТаблицаОборудованиеКРазборке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборудованиеКРазборке = Движения.смартОборудованиеКРазборке;
	ДвиженияОборудованиеКРазборке.Записывать = Истина;
	ДвиженияОборудованиеКРазборке.Загрузить(ТаблицаОборудованиеКРазборке);	
	
КонецПроцедуры

//++ #1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования
Процедура ДополнитьПараметрыИнициализацииПроведения(ДокументСсылка, Запрос) Экспорт

	ЗаявкаНаРазборкуОборудования 
		= Документы.смартЗаявкаНаРазборкуОборудования.ПолучитьСсылкуНаЗаявкуПоОснованию(ДокументСсылка);

	Запрос.УстановитьПараметр("ЭтоРазборкаОборудования", Не ЗаявкаНаРазборкуОборудования.Пустая());
	Запрос.УстановитьПараметр("ЗаявкаНаРазборкуОборудования", ЗаявкаНаРазборкуОборудования);
	Запрос.УстановитьПараметр("НазначениеЗаявкаНаРазборку", ЗаявкаНаРазборкуОборудования.Назначение);
	
	Если Не Запрос.Параметры.Свойство("Серия") Тогда
		Запрос.УстановитьПараметр("Серия", ЗаявкаНаРазборкуОборудования.Серия);
	КонецЕсли;
	
	Если Не Запрос.Параметры.Свойство("ПустойСклад") Тогда
		Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());	
	КонецЕсли;
	
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	ДанныеЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаНаРазборкуОборудования, 
															 "СборкаНеТребуется,Узел");
	Запрос.УстановитьПараметр("СборкаНеТребуется", ?(ДанныеЗаявки.СборкаНеТребуется = Неопределено, Ложь, ДанныеЗаявки.СборкаНеТребуется));
	Запрос.УстановитьПараметр("Узел", ДанныеЗаявки.Узел);
	//-- #Б2138 смарт: Шляпников 19.02.2025
	
КонецПроцедуры

#КонецОбласти
